// ************************************************************************************************
// Задача 1: Напишите программу, которая
// принимает на вход число (А) и выдаёт сумму чисел
// от 1 до А.
// Пример:
// 7 -> 28
// 4 -> 10
// 8 -> 36

// int Summa(int num)
// {
//     int result = 0;
//     for (int i = 1; i <= num; i++)
//         result += i;
//     return result;
// }

// // void Summa2(int num)
// // {
// //     int result = 0;
// //     for (int i = 1; i <= num; i++)
// //         result += i;
// //     System.Console.WriteLine($"Вы ввели: {num}, сумма всех чисел равна: {result}");
// // }


// System.Console.WriteLine("Введите число: ");
// int num = int.Parse(Console.ReadLine()!);
// int result = Summa(num);
// System.Console.WriteLine($"Вы ввели: {num}, сумма всех чисел равна: {result}");
// // Summa2(num);